balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16GP102.PIC
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="----rrrr-nnnnnnn" edc:cname="INTTREG" edc:desc="" edc:impl="0xcf3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000-0000000" edc:name="INTTREG" edc:nzwidth="0x10" edc:por="----0000-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VECNUM" edc:desc="" edc:mask="0x7f" edc:name="VECNUM" edc:nzwidth="7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR" edc:desc="" edc:mask="0xf" edc:name="ILR" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VECNUM0" edc:desc="" edc:mask="0x1" edc:name="VECNUM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM1" edc:desc="" edc:mask="0x1" edc:name="VECNUM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM2" edc:desc="" edc:mask="0x1" edc:name="VECNUM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM3" edc:desc="" edc:mask="0x1" edc:name="VECNUM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM4" edc:desc="" edc:mask="0x1" edc:name="VECNUM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM5" edc:desc="" edc:mask="0x1" edc:name="VECNUM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM6" edc:desc="" edc:mask="0x1" edc:name="VECNUM6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR0" edc:desc="" edc:mask="0x1" edc:name="ILR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR1" edc:desc="" edc:mask="0x1" edc:name="ILR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR2" edc:desc="" edc:mask="0x1" edc:name="ILR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR3" edc:desc="" edc:mask="0x1" edc:name="ILR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00931.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00932.Module">
          <edc:ModuleMacro edc:replace="%x%" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="44"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-00936.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-00936.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-00936.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:AdjustPoint edc:offset="36"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00995.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00995.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="116"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-00996.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00997.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xF843" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xfffe" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0xa" edc:modsrc="DOS-00998.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="118"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="TRISA" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="TRISA" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xffff" edc:name="TRISA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="PORTA" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------uuuuu" edc:name="PORTA" edc:nzwidth="0x10" edc:por="-----------xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0xffff" edc:name="RA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="LATA" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------uuuuu" edc:name="LATA" edc:nzwidth="0x10" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATA" edc:desc="" edc:mask="0xffff" edc:name="LATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="ODCA" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000" edc:name="ODCA" edc:nzwidth="0x10" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCA" edc:desc="" edc:mask="0xffff" edc:name="ODCA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="TRISB" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB12" edc:desc="" edc:mask="0x1" edc:name="TRISB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB15" edc:desc="" edc:mask="0x1" edc:name="TRISB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xffff" edc:name="TRISB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="PORTB" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB12" edc:desc="" edc:mask="0x1" edc:name="RB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xffff" edc:name="RB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LATB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB12" edc:desc="" edc:mask="0x1" edc:name="LATB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATB" edc:desc="" edc:mask="0xffff" edc:name="LATB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ODCB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ODCB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB2" edc:desc="" edc:mask="0x1" edc:name="ODCB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB3" edc:desc="" edc:mask="0x1" edc:name="ODCB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB5" edc:desc="" edc:mask="0x1" edc:name="ODCB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB6" edc:desc="" edc:mask="0x1" edc:name="ODCB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB10" edc:desc="" edc:mask="0x1" edc:name="ODCB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB11" edc:desc="" edc:mask="0x1" edc:name="ODCB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB12" edc:desc="" edc:mask="0x1" edc:name="ODCB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB15" edc:desc="" edc:mask="0x1" edc:name="ODCB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCB" edc:desc="" edc:mask="0xffff" edc:name="ODCB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="44"/>
        <edc:SFRDef edc:access="--------------n-" edc:cname="PADCFG1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------0-" edc:name="PADCFG1" edc:nzwidth="16" edc:por="--------------0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2a" edc:modsrc="DOS-01041.Module">
          <edc:ModuleExclude edc:impl="0xebef" edc:offset="0x20"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x2c" edc:end="0x2e" edc:modsrc="DOS-01041.Module">
          <edc:ModuleExclude edc:impl="0x3f" edc:offset="0x2c"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x32" edc:modsrc="DOS-01041.Module">
          <edc:ModuleExclude edc:impl="0x3f" edc:offset="0x30"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01293.Module"/>
        <edc:AdjustPoint edc:offset="736"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00828.Module"/>
        <edc:AdjustPoint edc:offset="40"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xffef" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="---nnnnn--------" edc:cname="RPINR0" edc:desc="" edc:impl="0x1f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111--------" edc:name="RPINR0" edc:nzwidth="0x10" edc:por="---11111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0x1f" edc:name="INT1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R0" edc:desc="" edc:mask="0x1" edc:name="INT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R1" edc:desc="" edc:mask="0x1" edc:name="INT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R2" edc:desc="" edc:mask="0x1" edc:name="INT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R3" edc:desc="" edc:mask="0x1" edc:name="INT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R4" edc:desc="" edc:mask="0x1" edc:name="INT1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
